{
  "personalInfo": {
    "name": "Zulfikar Rosadi",
    "title": "Full-Stack Web Developer",
    "email": "zulfikarrosadi31@gmail.com",
    "github": "https://github.com/zulfikarrosadi",
    "linkedin": "https://www.linkedin.com/in/zulfikarrosadi/",
    "summary": "Associate Cloud Engineer tersertifikasi Google dan lulusan Bangkit (Cloud Computing) dengan keahlian sebagai Full-Stack Developer. Berpengalaman menerapkan CI/CD, Docker, dan optimasi basis data untuk membangun sistem yang skalabel di PTIPD UIN Raden Intan Lampung"
  },
  "experience": [
    {
      "company": "Pusat Teknologi Informasi dan Pangkalan Data UIN Raden Intan Lampung",
      "role": "Web Fullstack Developer (Magang)",
      "duration": "17 Jun 2024 - Sekarang",
      "responsibilities": [
        "Bertanggung jawab untuk membuat, memelihara, dan mengembangkan fitur baru untuk perangkat internal menggunakan Django, PostgreSQL, dan JavaScript.",
        "Berkolaborasi erat dengan tim pengembangan, memanfaatkan Git dan GitHub untuk kontrol versi dan kerja sama tim.",
        "Peran difokuskan pada peningkatan fungsionalitas dan peningkatan pengalaman pengguna sistem internal utama."
      ]
    },
    {
      "company": "UIN Raden Intan Lampung",
      "role": "Laboratory Teaching Assistant - Advance Programming",
      "duration": "February 2024 - June 2024",
      "responsibilities": [
        "Mentored students in advanced programming concepts: software architecture, design patterns, version control systems (Git), and clean code best practices.",
        "Taught hands-on implementation of tools like Django, Flask, and NumPy, guiding students to build real-world projects (e.g., web apps)."
      ]
    },
    {
      "company": "UIN Raden Intan Lampung",
      "role": "Laboratory Teaching Assistant - Web Programming",
      "duration": "September 2023 - December 2023",
      "responsibilities": [
        "Instructed students in full-stack web development fundamentals, including Django, JavaScript, PHP, HTML/CSS, and responsive design principles.",
        "Troubleshot and provided feedback on debugging, version control (Git), best practices for clean, maintainable code."
      ]
    },
    {
      "company": "UIN Raden Intan Lampung",
      "role": "Laboratory Teaching Assistant - Database Management",
      "duration": "February 2023-June 2023",
      "responsibilities": [
        "Instructed students in MySQL for large-scale data management, covering database design, normalization, indexing, and optimization techniques.",
        "Guided troubleshooting of common issues like data redundancy, query inefficiency, and transaction management."
      ]
    }
  ],
  "projects": [
    {
      "title": "Belajaro",
      "description": "Sebuah sistem pembelajaran terbuka yang kolaboratif dan memaksimalkan aksesibilitas untuk tuna netra dan tuna rungu yang mengikuti standar aksesibilitas WCAG 2.2.",
      "technologies": [
        "Sveltekit",
        "Postgresql",
        "Typescript",
        "Adobe PDF API"
      ],
      "link": "https://belajaro.vercel.app"
    },
    {
      "title": "BIOS UIN Raden Intan Lampung",
      "description": "Sinkronisasi data keuangan UIN Raden Intan Lampung dengan kemenkeu. Bertanggung jawab mengembangkan sistem menggunakan Django, MySQL, Postgresql, dan HTMX, serta membangun CICD Pipeline untuk automatic build dan deployment Docker image ke Server UIN Raden Intan Lampung.",
      "technologies": [
        "Django",
        "MySQL",
        "Postgresql",
        "HTMX",
        "CICD",
        "Docker"
      ],
      "link": "https://bios.radenintan.ac.id"
    },
    {
      "title": "Kreasi",
      "description": "A mobile app that suggests personalized learning road-maps based on user assessments. A RESTful API was developed for user assessments and recommendations, hosted on Google Cloud using App Engine and Cloud Run for scalability. 45]",
      "technologies": [
        "Hapi.js",
        "MySQL",
        "Google Cloud App Engine",
        "Cloud Run"
      ],
      "link": "https://github.com/orgs/kreasi-capstone-project"
    },
    {
      "title": "Juadah API",
      "description": "A web-based bakery platform for purchasing products online. Built a robust API with TypeScript and Express, ensuring data integrity with Zod. Implemented product image uploads with Multer and integrated Midtrans for payments.",
      "technologies": [
        "TypeScript",
        "Express",
        "MySQL",
        "Zod",
        "Multer",
        "Jest (CI/CD with GitHub Actions & Husky)",
        "Midtrans"
      ],
      "link": "https://github.com/zulfikarrosadi/juadah-backend"
    },
    {
      "title": "Code Roast",
      "description": "A community-driven forum for programmers to share insights, memes, and discussions. Implemented JWT-based authentication, voting systems, and code snippet highlighting. Designed structured categories, subforums, and moderation tools for content management.",
      "technologies": [
        "SvelteKit",
        "Golang",
        "MySQL",
        "JWT",
        "CI using Github Action"
      ],
      "link": "https://github.com/zulfikarrosadi/code_roast"
    }
  ],
  "education": [
    {
      "name": "UIN Raden Intan Lampung",
      "title": "S1 Sistem Informasi",
      "duration": "Belum Lulus (Semester 8)",
      "details": [
        "IPK: 3.70"
      ]
    },
    {
      "name": "Bangkit Academy",
      "title": "Cloud Computing",
      "duration": "September 2024 - Januari 2025",
      "details": [
        "Program intensif selama 5-6 bulan (500-900 jam belajar) yang menyatukan modul teknis GCP (Google Cloud Foundations, Compute Engine, BackEnd, DevOps, Machine Learning), sesi sinkron (tech, soft skills, dan bahasa Inggris), serta capstone project berbasis tim."
      ]
    },
    {
      "name": "UKM Bahasa UIN Raden Intan Lampung",
      "title": "Kepala Divisi Informasi dan Komunikasi",
      "duration": "31 Jan 2023 - 31 Jan 2024",
      "details": [
        "Menjabat sebagai Ketua Divisi Informasi dan Komunikasi, mengelola citra publik dan strategi komunikasi organisasi.",
        "Menjadi Ketua Koordinator PDD dan panitia UKM Bahasa Got Talent 3.0, mengembangkan kemampuan kepanitiaan dan kepemimpinan."
      ]
    }
  ],
  "certifications": [
    {
      "title": "Associate Cloud Engineer",
      "publisher": "Google",
      "durationStart": "19 Mei 2025",
      "durationEnd": "19 Mei 2028",
      "credentials": "https://www.credly.com/badges/f05131fa-0b93-42a8-ba01-0694c962dbb7/public_url",
      "skills": [
        "Menerapkan aplikasi",
        "Mengelola proyek berbasis cloud",
        "Memelihara dan memantau layanan menggunakan Google Cloud Platform (GCP)"
      ]
    },
    {
      "title": "Junior Web Developer",
      "publisher": "Badan Nasional Sertifikasi Profesi",
      "durationStart": "3 Okt 2023",
      "durationEnd": "3 Okt 2026",
      "credentials": "https://drive.google.com/file/d/14X399Z6v-4-O4EmcQQXj8pfXzd8hn6u3/view?usp=sharing",
      "skills": [
        "Penguasaan HTML, CSS, JavaScript",
        "Prinsip backend seperti penggunaan database dan server"
      ]
    }
  ]
}